# а) Напишите программу на ассемблере RISC-V ,
# которая принимает на вход целое число x и выводит 1,
# если оно соответствует номеру студента в списке
# группы и  0, если не совпадает.

# Мой номер в списке - 8

.data
	student_num: .word 8 # - номер по списку
	ask_x: .asciz "Введите целое число x: "

.text
.globl main
main:
	# Печатаем в консоль: "Введите целое число x: "
	li a7, 4
	la a0 ask_x
	ecall
	
	# Запрашиваем  у пользователя x и сохраняем
	
	li a7, 5
	ecall
	mv t0, a0
	
	# Загружаем номер студента
	
	la t1, student_num
	lw t1, 0(t1)
	
	# Сравниваем 
	
	beq t0, t1, match
	j no_match
# Если ранвны
match:
	li a7, 1
	li a0, 1
	ecall
	j exit
# Если не ранвны	
no_match:
	li a7, 1
	li a0, 0
	ecall
	j exit

# Завершаем программу
exit:
	li a7, 10
	ecall
